In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['Category','Project_Title','Pledged','Country','Date_Start']

In [3]:
category = ['Games','Games','Games','Film&Video','Film&Video','Film&Video']

In [4]:
title = ['The Last Faith','Magic Puzzles','Dinosaur Fossil Hunter','Beyond your eyes','5151','8-bit wars']

In [5]:
pledged = [92774,2873519,7962,276,23963,6950]

In [6]:
country = ['UK','USA','Poland','Bulgaria','USA','UK']

In [7]:
date_start = ['2020-03-21','2020-03-11','2020-04-16','2022-02-09','2020-04-10','2020-03-19']

In [9]:
df = pd.DataFrame({'Category': category,'title':title,'pledged':pledged,'Country': country,'Date_Start': date_start})

In [10]:
df

     Category                   title  pledged   Country  Date_Start
0       Games          The Last Faith    92774        UK  2020-03-21
1       Games           Magic Puzzles  2873519       USA  2020-03-11
2       Games  Dinosaur Fossil Hunter     7962    Poland  2020-04-16
3  Film&Video        Beyond your eyes      276  Bulgaria  2022-02-09
4  Film&Video                    5151    23963       USA  2020-04-10
5  Film&Video              8-bit wars     6950        UK  2020-03-19

In [11]:
df.groupby('Category')

In [12]:
df

     Category                   title  pledged   Country  Date_Start
0       Games          The Last Faith    92774        UK  2020-03-21
1       Games           Magic Puzzles  2873519       USA  2020-03-11
2       Games  Dinosaur Fossil Hunter     7962    Poland  2020-04-16
3  Film&Video        Beyond your eyes      276  Bulgaria  2022-02-09
4  Film&Video                    5151    23963       USA  2020-04-10
5  Film&Video              8-bit wars     6950        UK  2020-03-19

In [13]:
df.groupby('Category').sum()

            pledged
Category
Film&Video    31189
Games       2974255

In [14]:
df.groupby('Category').mean()

                  pledged
Category
Film&Video   10396.333333
Games       991418.333333

In [15]:
df.groupby('Category').count()

            title  pledged  Country  Date_Start
Category
Film&Video      3        3        3           3
Games           3        3        3           3

In [16]:
print(type(df['Date_Start'][0]))
#tutaj nasza data jest jeszcze zwyklym stringiem

<class 'str'>

In [17]:
df['Date_Start'] = pd.to_datetime(df['Date_Start'])

In [18]:
print(type(df['Date_Start'][0]))
#tutaj nasza data zostala zamieniona

<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [19]:
df.groupby(pd.Grouper(key='Date_Start',freq='Y')).sum()

            pledged
Date_Start
2020-12-31  3005168
2021-12-31        0
2022-12-31      276

In [24]:
df.groupby(pd.Grouper(key='Date_Start',freq='Y')).agg({'pledged':'sum','title':'count'})

            pledged  title
Date_Start
2020-12-31  3005168      5
2021-12-31        0      0
2022-12-31      276      1

In [26]:
df.groupby(['Country','Category']).sum()

                     pledged
Country  Category
Bulgaria Film&Video      276
Poland   Games          7962
UK       Film&Video     6950
         Games         92774
USA      Film&Video    23963
         Games       2873519